---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FillPatternIdParamNoNo
source: html/f1d3c00c-d44b-06ef-4694-446e71190168.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FillPatternIdParamNoNo Property

"Fill Pattern"

## Syntax (C#)
```csharp
public static ForgeTypeId FillPatternIdParamNoNo { get; }
```